<a href="https://colab.research.google.com/github/maja74maja74/CSC302_HW1/blob/main/Matt_Jackson_HW1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
from google.colab import drive
drive.mount ('/content/drive')

Mounted at /content/drive

In [5]:
import csv

with open("/content/drive/MyDrive/DATA/olympic_medals.csv") as f:
    reader = csv.DictReader(f)
    olympics_data = list(reader)

In [4]:
import pandas as pd

In [7]:
df = pd.DataFrame(olympics_data)

In [11]:
df.info
#2a answer 2394 rows, 8 columns

<bound method DataFrame.info of      Gender              Event Location  Year Medal                   Name  \
0         M         10000M Men      Rio  2016     G          Mohamed FARAH
1         M         10000M Men      Rio  2016     S  Paul Kipngetich TANUI
2         M         10000M Men      Rio  2016     B           Tamirat TOLA
3         M         10000M Men  Beijing  2008     G        Kenenisa BEKELE
4         M         10000M Men  Beijing  2008     S         Sileshi SIHINE
...     ...                ...      ...   ...   ...                    ...
2389      W  Triple Jump Women   Athens  2004     S      Hrysopiyi DEVETZI
2390      W  Triple Jump Women   Athens  2004     B       Tatyana LEBEDEVA
2391      W  Triple Jump Women  Atlanta  1996     G         Inessa KRAVETS
2392      W  Triple Jump Women  Atlanta  1996     S        Inna LASOVSKAYA
2393      W  Triple Jump Women  Atlanta  1996     B       Sarka KASPARKOVA

     Nationality    Result
0            GBR  25:05.17
1            KEN  27:05.64
2            ETH  27:06.26
3            ETH  27:01.17
4            ETH  27:02.77
...          ...       ...
2389         GRE     15.25
2390         RUS     15.14
2391         UKR     15.33
2392         RUS     14.98
2393         CZE     14.98

[2394 rows x 8 columns]>

In [13]:
df.dtypes
#2b Answer

Gender         object
Event          object
Location       object
Year           object
Medal          object
Name           object
Nationality    object
Result         object
dtype: object

In [16]:
len(df['Location'].unique())
#2c answer

23

In [23]:
df[(df["Medal"] == "G, S, B") + (df["Nationality"] == "USA")].count
#2d answer 638 medals

<bound method DataFrame.count of      Gender             Event   Location  Year Medal             Name  \
37        M        10000M Men     London  2012     S       Galen RUPP
51        M        10000M Men      Tokyo  1964     G      Billy MILLS
67        M        10000M Men  Stockholm  1912     S   Lewis TEWANIMA
70        M          100M Men        Rio  2016     S    Justin GATLIN
74        M          100M Men    Beijing  2008     B       Walter DIX
...     ...               ...        ...   ...   ...              ...
2326      W  Pole Vault Women    Beijing  2008     S    Jennifer SUHR
2328      W  Pole Vault Women     Sydney  2000     G    Stacy DRAGILA
2331      W  Pole Vault Women     London  2012     G    Jennifer SUHR
2337      W    Shot Put Women        Rio  2016     G  Michelle CARTER
2358      W    Shot Put Women       Rome  1960     B    Earlene BROWN

     Nationality    Result
37           USA  27:30.90
51           USA   28:24.4
67           USA   32:06.6
70           USA      9.89
74           USA      9.91
...          ...       ...
2326         USA       4.8
2328         USA       4.6
2331         USA      4.75
2337         USA     20.63
2358         USA     16.42

[638 rows x 8 columns]>

In [28]:
df.groupby(['Nationality','Medal']).count()
#2e Answer

                   Gender  Event  Location  Year  Name  Result
Nationality Medal
ALG         B           2      2         2     2     2       2
            G           4      4         4     4     4       4
            S           3      3         3     3     3       3
ARG         G           2      2         2     2     2       2
            S           2      2         2     2     2       2
...                   ...    ...       ...   ...   ...     ...
USA         S         206    206       206   206   206     206
VEN         B           1      1         1     1     1       1
            S           1      1         1     1     1       1
YUG         S           1      1         1     1     1       1
ZAM         S           1      1         1     1     1       1

[218 rows x 6 columns]